import statsmodels.stats.weightstats as sw

arr1 = [
    23,36,42,34,39,34,35,42,53,28,
    49,39,46,45,39,38,45,27,43,54,
    36,34,48,36,47,44,48,45,44,33,
    24,40,50,32,39,31
]
arr2 = [
    41,34,36,32,32,35,33,31,35,34,
    37,34,31,36,37,34,33,37,33,38,
    38,37,34,36,36,31,33,36,37,35,
    33,34,33,35,34,34,34,35,35,34
]

tstats, pvalue = sw.ztest(arr1, arr2, value=0, alternative='two-sided')
print(tstats, pvalue)

# 3.775645601380307 0.0001595937672736755
# 假设置信度为 0.05 ，由于 p 值小于置信度 0.05 ，拒绝原假设，接受备选假设。所以两个独立样本的总体均值相等。

